package by.htp.les02.start;

//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь примоугольника.

public class Task07 {

	public static void main(String[] args) {
		
		double a;
		double b;
		
		a = 5;
		b = a / 2;
		
		double area = a * b;
		
		System.out.println("Площадь прямоугольника равна " + area);

	}

}
